# print('Введите первое число:')
# a = int (input())
# print('Введите второе число:')
# b = int (input()) 
# print (a,'+',b,'=', a+b)

# c=5.89
# print(c)
# print(type(c))
# c=int(c)
# print(c)
# print(type(c))


# a=5>4
# print(a)

# a=1<4 and 5>2
# print(a)

# a=1==2
# print(a)

# a=1!=2
# print(a)

# a= 'cnjg'
# b='cnjg'
# print(a==b)

# a=1<2<5<7<10
# print(a)


# username=input('Введите имя:')
# if username=='Маша':
#     print('Ура, это же Маша!')
# elif username=='Марина':
#     print('Я так ждал Вас, Марина')
# elif username=='Ильнар':
#     print('Ильнар-топ')
# else:
#     print('Привет,',username)


# n=423
# summa=0
# while n>0:
#     x=n%10
#     summa=summa+x
#     n=n//10
# print(summa)


# Найти минимальный делитель заданного числа n

# n=int(input())
# flag=True
# i=2
# while flag:
#     if n%i==0: # если остаток при делении числа n на i равен 0
#         flag =False
#         print(i)
#     elif i>n//2: # делитель числа не может превышать введенное число, деенное на 2
#         print(n)
#         flag =False
#     i+=1


# Цикл for

# for i in 1,-2,3,14,5:
#     print(i)


# Функция range

# r=range(5)
# r=range(2,5)
# r=range(1,10,2)
# r=range(100,0,-20)
# for i in r:
#     print(i)


# Цикл for в строке 

# a='qwerty'
# for i in a:
#     print(i)
     

# Вывести строку 
# line =""
# for i in range(5):
#     line=""
#     for j in range (5):
#         line+="*"
#     print(line)



# Функции строк
# text='СЪЕШЬ ещё этих МягКих францизский булок'
# print(len(text)) - позволяет узнать длину текста
# print('ещё' in text) - позволяет проверить наличие символов в тексте
# print(text.lower()) - переводит текст в маленький регистр
#print(text.upper()) #- переводит текст в большой регистр 
# print(text.replace('ещё', 'ЕЩЁ')) - позвлляет заменять слова в тексте 

